<?php
	function generate(string $name, string $type, string $level, int $length) {
		$kumda = [
			"low" => [
				"{{name}}ไอ้คนบ้าไอ้คนผีทะเล",
				"ไอ{{name}}คนใจร้าย",
				"ไอ{{name}}หน้าหมา",
				"{{name}}สาระแนนัก",
				"ไม่ต้องยุ่งได้ปะ{{name}}",
				"ไอ{{name}}นิสัยไม่ดี",
				"{{name}}เลิกเป็นสก๊อยได้ยัง",
				"ไอต้าว{{name}}คนไม่ดี",
				"ไอ{{name}}ชอบทำร้ายจิตใจคนอื่น",
				"อย่าเสี่ยว{{name}}",
				"{{name}}ไม่ต้องเสือกทุกเรื่องได้ปะ",
				"{{name}}อย่าเสร่อไปทั่ว",
				"ทำตัวไม่น่ารักเลยนะ ไอต้าวนิสัยไม่ดี",
				"ทำตัวเเบบนี้ ไปทำที่บ้านนะ",
				"ทำตัวแบบนี้ ไม่คุยด้วยแล้วนะ",
				"เยดเเหม่ม",
				"{{name}}มีมารยาทแค่นี้หรอ",
				"พ่อแม่ไม่คุยด้วยหรอไง{{name}}",
				"{{name}}มีอันเท่านี้เองหรอ",
				"{{name}}IQ สูงได้เท่านี้หรอ",
				"สมอง{{name}}บูดหรอ",
				"เลิกพูดแล้วไปแผ่เมตตานะ{{name}}",
				"สันหลังหรือเสาไฟฟ้าอะ{{name}}",
				"กลัวตายแล้วไม่ได้พูดหรอไง{{name}}",
				"{{name}}เลิกทำตัวเหมือนปรสิทได้มั้ยอะ",
				"ทำไม{{name}}ชอบทำตัวต่ำอ่ะ กลัวความสูงหรอ",
				"ถ้า{{name}}ชอบกัด ก็ไปเกิดเป็นสัตว์นะ",
				"{{name}}เกิดไปเปนขยะน่าจะมีประโยชน์กว่า",
				"ยกระดับสมอง{{name}}บ้างก็ดีนะ",
				"คนอย่าง{{name}}ตายไปเปนปุ๋ยต้นไม้ยังไม่อยากดูดซึม",
				"ทำตัวเเบบนี้ ระวังเพื่อนไม่คบนะ"
			],
			"middle" => [
				"ไอ้{{name}}ไอระยำหมา",
				"พ่องมีงอ่ะไอ{{name}}",
				"อย่ามาทะลึ่งไอ{{name}}",
				"อยู่ไปก็รกโลกมึงอ่ะไอ้{{name}}",
				"ไม่อยากหายใจอากาศเดียว กับมึงเลยว่ะไอ{{name}}",
				"ไอ้{{name}}หน้าหี",
				"ไอ{{name}}นั้นหน้าหรอ? นึกว่าปูนซีเมน! ด๊านด้าน",
				"ตั้งเเต่มีพรบ.คุ้มครองสัตว์นี่ก็กล้าขึ้นเยอะเนอะไอ{{name}}",
				"ไม่อยากสนิทกับไอ{{name}}อ่ะ เดี๋ยวติดเสนียด",
				"ไม่อยากอยู่ร่วมโลกกับมึงเลยไอ{{name}}",
				"โคตรเหี้ยเลยไอสัสเยดแม่{{name}}",
				"หุบปากเเล้วเก็บอะไมเลสไว้ย่อยอาหารเถอะนะไอ{{name}}",
				"อย่าลืมให้อาหารสุนัขในปากนะไอสัส{{name}} เดี๋ยวมันตาย",
				"กลับไปเกิดเป็นสุนัขนะไอสัส{{name}} ถ้าปากจะขนาดนี้",
				"ที่ไหนขายมารยาทบ้าง จะออกเงินซื้อให้ไอ{{name}}สักหน่อย",
				"ไอ{{name}}อีควายไอโง่",
				"ไร้มารยาทไอเวรไอ{{name}}",
				"ไปเล่นกับพ่อมึงนะไอสัส{{name}}",
				"ไอสมองอะมีบา คิดได้เเค่นี้หรอ",
				"เหนื่อยกับมึงว่ะ",
				"พ่องตาย",
				"นั่นสมองหรือกล่องใส่ขี้เรื่อย",
				"นั่นหน้าหรือฟาร์มเห็ด",
				"ไอหน้าดาวอังคาร",
				"ไอแม่เย็ด",
				"ไอเหี้ย",
				"ไอสัสนรกนี่",
				"ไอควยเหอะ",
				"มึงเป็นตลกคาเฟ่อ่อ",
				"อีลามกจกเปรต"
			],
			"high" => [
				"ไอ้{{name}}คนอย่างมึงนี่แม่ไม่น่าให้ผ่านหีออกมาได้นะไอ้สัส",
				"ไอ้หมา{{name}}เย็ดแม่",
				"ไอ้เหี้ย{{name}}ทะลุถุงยางมาเกิด",
				"ไอ้ระยำหมา{{name}}ไอ้ชาติชั่ว",
				"พ่อเเม่{{name}}ไม่สั่งสอนหรอวะ",
				"สมองพิการหรอไอ้{{name}} สันดารถึงได้ต่ำเเบบนี้",
				"หายใจไม่สะดวกหรอไอ{{name}} ถอดหน้ากากบ้างก็ได้นะ",
				"ไอ้{{name}}สมองหมาปัญญาควาย",
				"พ่อ{{name}}น่าจะปล่อยมึงลงท่อน้ำแทนช่องคลอดว่ะ",
				"สงสารแม่{{name}}หวะที่คลอดลูกออกมาเป็นควาย",
				"ชาติหน้าขอให้{{name}}เกิดเป็นคนไทยไอสัตว์",
				"นั่นหี{{name}}หรือดาราจักรแอนดรอมิดา",
				"{{name}}นั่นกลิ่นหีหรือหมีตายในดงป่า",
				"{{name}}ควยเล็กแต่havesex ไปเรื่อย",
				"{{name}}โตมาเเบบไหนวะ สถาบันซ่องหรือครอบครัว?",
				"อีหีดำ"
			]
		];

		$loo = [
			"ลึงมูไล่มู่เหลือกสู่หลิดุ",
			"ลึงมูหล่าอยู่เลอะยุไลอูหลัดสู่",
			"เหลิกลุลำทูลัวตูเลือนหมูเหลิดกู่ลามูหลากจุล่องซุ",
			"ลวยคูไลรูไลอูหลัดสู"
		];

		$use = [];
		$text = "";

		for ($i=0; $i < $length; $i++) {
			switch ($type) {
				case 'teen':
					do {
						$random = rand(0,count($kumda[$level])-1);
					} while(in_array($random, $use));
					$use[] = $random;
					$text = $text . str_replace("{{name}}", $name, $kumda[$level][$random]) . " ";
					break;
				
				case 'loo':
					if($i > count($loo)-1) {
						break;
					}
					do {
						$random = rand(0, count($loo)-1);
					} while(in_array($random, $use));
					$use[] = $random;
					$text = $text . str_replace("{{name}}", $name, $loo[$random]) . " ";
					break;
			}
		}
		
		$text = mb_substr($text, 0, -1);
		return $text;
	}

	header('Content-Type: application/json');

	if(!isset($_GET['name']) || !isset($_GET['type']) || !isset($_GET['level']) || !isset($_GET['length']) || !is_numeric($_GET['length'])) {
		http_response_code(400);
		die(json_encode("Bed Request"));
	}
	if(!in_array($_GET['type'], ['teen', 'loo'])) {
		http_response_code(400);
		die(json_encode("Type not found"));
	}
	if(!in_array($_GET['level'], ['low', 'middle', 'high'])) {
		http_response_code(400);
		die(json_encode("Level not found"));
	}

	echo json_encode(generate($_GET['name'], $_GET['type'], $_GET['level'], $_GET['length']), JSON_UNESCAPED_UNICODE);
?>






























